lucky_choices = [
    "- О, сегодня мне повезло, конечно! Вы берёте компот и наслаждаетесь жизнью.",
    "- Жаль, что компота нет. Не повезло.",
    "- После пельменей будто сама жизнь становится к тебе благосклоннее!",
    "Друг ушёл есть пельмени без вас.",
    "Вам повезло: у впереди стоящего человека было мало продуктов, вы быстро вернулись в общежитие.",
    'Человек решил убрать часть продуктов. Вы услышали: "Галя, у нас отмена..." Простояв минут 30 в очереди, вы довольно раздраженный вернулись в общагу.',
    "Вы неожиданно встретили лучшего студента потока. Разговорившись, вы узнаёте, что он расписал уже все билеты и может вам их отдать по доброте душевной. Действительно повезло! Вы вернулись обратно.",
    "Отдохнув, вы вернулись обратно.",
    "Сегодня ваш день! Убираетесь не Вы.",
    "О, этим «счастливчиком» оказались вы! Пришлось убираться…",
    "Лучше покричать, чем нет, хуже точно не будет.",
    "Это странная затея."
]
'''Нечётные выборы повышают удачу, чётные - либо нейтральные, либо отнимают удачу'''

study_choices = [
    "- Пора узнать, какой же предмет я изучал в семестре... Вы взялись за билеты.",
    "Вы решили поспать несколько часов.",
    "Экзамен скоро - пока есть силы, нужно заниматься.",
    "Всё же, зачем портить билетами такой прекрасный день!",
    "Вы ещё чуток позанимались. Пора пойти спать.",
    "Всё же, воздух полезен для здоровья. Вернувшись, вы сразу легли спать.",
    "Вы решаете взять пример с соседей и поботать.",
    "Вы решаете, что выучите всё потом и тихо смотрите сериалы, чтобы не мешать соседям ботать.",
    "И вновь звук ручки разлетелся по всей комнате.",
    "Вы решили поспать.",
    "Позанимавшись, вы легли спать.",
    "Вы решили лечь спать.",
    "Пора сесть ботать серьёзно.",
    "Заботать предмет можно и на экзамене.",
    "- Хорошая идея! Вы согласились.",
    "Вы отказались: заниматься сейчас Вам не хочется.",
    "Вы повторили материал и легли спать.",
    "Перед смертью не надышишься - лучше пойти спать.",
]
'''нечётные выборы - выбор занятия, иначе - отдых (тут не учитывается усталость)'''

study_choices_without_power = [
    "Вы ещё чуток позанимались. Но сильно устали. Возможно, стоило и отдохнуть...\n Пора пойти спать.",
    "Позанимавшись, вы сильно устали и легли спать. Переутомление вредно для здоровья.",
    "Вы повторили материал, но невероятно устли - возможно, стоило лечь пораньше ",
]
'''выбирается, когда есть третье занятие в день'''

first_study_button = [
    "Пока есть силы, нужно позаниматься - будет легче на экзамене.",
    "Ботать с новыми силами!",
    "Лучше ещё позанимаюсь. Позднее Вы легли спать",
    "Утром заниматься получается лучше.",
    "Вы решили позаниматься."
    "Да",
    "Нужно собраться.",
    "Давай повторим материал.",
    "Последний рывок!"
]

second_study_button = [
    "Время пока есть, можно и отдохнуть.",
    "Поиграть в любимую игру.",
    "Пойду прогуляюсь. Вернувшись, вы сразу легли спать.",
    "Нет, я лучше вечером...",
    "Вы решили отдохнуть.",
    "Нет",
    "Времени полно!",
    "Я пас.",
    "Я достаточно подготовился."
]

first_lucky_button = [
    "Яблочный компот",
    "С радостью!",
    "Самообслуживания.",
    "В парк - прекрасное место!",
    "Первую соломинку",
    "ХАЛЯВА ПРИДИ! ХАЛЯВА ПРИДИ!"
]

second_lucky_button = [
    "Ягодный компот",
    "Как-то не хочется...",
    "С кассиром.",
    "В качалку - спорт полезен для здоровья",
    "Вторую соломинку",
    "Я лучше промолчу."
]

key_situations = [
    "Осталось три дня до экзамена.",
    "Осталось два дня до экзамена.",
    "Остался один день до экзамена.",
    "День экзамена.",
    "Результаты экзамена:"
]

main_text = [
    "Новое утро, новый день! Остался последний экзамен и он всего через три дня...",
    "Незаметно наступило время обеда. Вы захотели есть и пошли в КСП.",
    "-Надеюсь, там сегодня будет мой любимый напиток...",
    "Вы вернулись в общежитие. После сытного обеда хочется:",
    "Спустя часа 4 к вам в комнату заходит ваш друг - он предлагает вам поесть с ним пельменей.",
    "Вы посмотрели в окно - на улице уже вечер, а летние вечера особенно прекрасны. Но стоит ли вам позаниматься ещё?",
    "Вы проснулись от звука перелистываемых страниц - соседи занимались уже с утра. \n Позавтракав, и вы задумались, стоит ли вам позаниматься:",
    "Через некоторое Вы решили пойти в магазин за едой. Выбрав всё необходимое, вы подходите к кассам, где нужно ждать одного человека в очереди.\n Вы решаете ждать кассу:",
    "Через несколько часов вы решаете выйти из комнаты - не всё же время в общаге сидеть! Вы идёте...",
    "Вы снова задумались - стоит ли вечером поучить билеты?",
    "Проснувшись, вы осознали, что до экзамена остался 1 день.",
    "Вдруг соседи решили, что хорошей идеей за день до экзамена будет убраться в комнате.\nРешили, что убирать будет тот, кто вытянет маленькую соломинку.\n Двое уже вытянули 2 длинных соломинки, теперь Ваша очередь вытягивать:",
    "После уборки, соседи пригласили Вас вместе повторить материал.",
    "Вечером стало шумно - студенты начали кричать: «Халява приди!». Вы в эту байку никогда не верили - но, возможно, стоит покричать?",
    "После крика студентов вы думаете, стоит ли повторить материал перед экзаменом?",
    "Вы идёте в аудиторию. Вся ваши знания, Вся ваша удача будет влиять на результат экзамена, Вам всегда это было известно.",
    "Вы тянете билет и получаете…",
    "Вы сели его расписывать, и тут экзаменатор называет ваше имя. Вы оборачиваетесь и смотрите на экзаменатора:",
    "В итоге Вы рассказываете свой билет экзаменатору. Он задаёт вам вопросы и в итоге отпускает вас."
]

result_text = [
    "К сожалению, Вас отправили на пересдачу...",
    "Вы смогли пережить эту сессию - у вас уд(3).",
    "Вы почти смогли получить хор - но всё же это уд(4)",
    'Вам поставили "пацанский" хор(5) - можете гордиться собой.',
    "А Вы неплохо знаете материал - хор(6).",
    "Почти отл - у Вас хор(7). Но кого это волнует, когда сессия уже закрыта? Точно не Вас.",
    "Отл(8)! Вы отлично поработали.",
    "Отл(9)! Вопрос на 10 был слишком сложным.",
    "ОТЛ(10)! Вы - огромный молодец!"
]
'''Концовки игры'''
