lucky_choices = [
    "- О, сегодня мне повезло, конечно!\n Вы берёте компот и наслаждаетесь жизнью.",
    "- Жаль, что компота нет. Не повезло.",
    "- После пельменей будто сама жизнь становится к тебе благосклоннее!",
    "Друг ушёл есть пельмени без вас.",
    "Вам повезло: у впереди стоящего человека было мало продуктов, вы быстро вернулись в общежитие.",
    'Человек решил убрать часть продуктов. Вы услышали: "Галя, у нас отмена..." Простояв минут 30 в очереди, вы довольно раздраженный вернулись в общагу.',
    "Вы неожиданно встретили лучшего в своём потоке. Разговорившись, вы узнаёте, что он расписал уже все билеты и может вам их отдать по доброте душевной. Действительно повезло!",
    "Отдохнув, вы вернулись обратно.",
    "Сегодня ваш день! Убираетесь не Вы.",
    "О, этим «счастливчиком» оказались вы! Пришлось убираться…",
    "Лучше покричать, чем нет, хуже точно не будет.",
    "Это странная затея."
]
'''Нечётные выборы повышают удачу, чётные - либо нейтральные, либо отнимают удачу'''

study_choices = [
    "- Пора узнать, какой же предмет я изучал в семестре...\n Вы взялись за билеты.",
    "Вы решили поспать несколько часов.",
    "Экзамен скоро - пока есть силы, нужно заниматься.",
    "Всё же, зачем портить билетами такой прекрасный день!",
    "Вы ещё чуток позанимались.\n Пора пойти спать.",
    "Всё же, воздух полезен для здоровья.\n Вернувшись, вы сразу легли спать.",
    "Вы решаете взять пример с соседей и поботать.",
    "Вы решаете, что выучите всё потом и тихо смотрите сериалы, чтобы не мешать соседям ботать.",
    "И вновь звук ручки разлетелся по всей комнате.",
    "Вы решили поспать.",
    "Позанимавшись, вы легли спать.",
    "Вы решили лечь спать.",
    "Пора сесть ботать серьёзно.",
    "Заботать предмет можно и на экзамене.",
    "- Хорошая идея!\n Вы согласились.",
    "Вы отказались: заниматься сейчас Вам не хочется.",
    "Вы повторили материал.",
    "Перед смертью не надышишься - лучше пойти спать.",
]
'''нечётные выборы - выбор занятия, иначе - отдых (тут не учитывается усталость)'''

study_choices_without_power = [
    "Вы ещё чуток позанимались. Но сильно устали. Возможно, стоило и отдохнуть...\n Пора пойти спать.",
    "Позанимавшись, вы сильно устали и легли спать. Переутомление вредно для здоровья.",
    "Вы повторили материал, но невероятно устли - возможно, стоило лечь пораньше ",
]
'''выбирается, когда есть третие занятие в день'''